In [3]:
import pandas as pd

In [4]:
df1=pd.DataFrame([["Shah", "Male", 114000.00],
                  ["Vats", "Male" ,65000.00],
                  ["Vats", "Female", 43150.00],
                  ["Kumar", "Female", 69500.00],
                  ["Vats", "Female", 155000.00],
                  ["Kumar", "Male", 103000.00],
                  ["Shah", "Male", 55000.00],
                  ["Shah", "Female", 112400.00],
                  ["Kumar", "Female", 81030.00],
                  ["Vats", "Male", 71900.00]], columns=["Name", "Gender", "MonthlyIncome (Rs.)"])

df1

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male             114000.0
1   Vats    Male              65000.0
2   Vats  Female              43150.0
3  Kumar  Female              69500.0
4   Vats  Female             155000.0
5  Kumar    Male             103000.0
6   Shah    Male              55000.0
7   Shah  Female             112400.0
8  Kumar  Female              81030.0
9   Vats    Male              71900.0

In [5]:
#  Calculate and display familywise gross monthly income.
df1.groupby("Name")["MonthlyIncome (Rs.)"].sum()

Name
Kumar    253530.0
Shah     281400.0
Vats     335050.0
Name: MonthlyIncome (Rs.), dtype: float64

In [10]:
#Calculate and display the member with the highest monthly income in a family.
df1.groupby("Name")["MonthlyIncome (Rs.)"].max()

Name
Kumar    103000.0
Shah     114000.0
Vats     155000.0
Name: MonthlyIncome (Rs.), dtype: float64

In [11]:
#Calculate and display monthly income of all members with income greater than Rs. 60000.00.
df1.loc[df1.iloc[:, 2]>60000, :]

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male             114000.0
1   Vats    Male              65000.0
3  Kumar  Female              69500.0
4   Vats  Female             155000.0
5  Kumar    Male             103000.0
7   Shah  Female             112400.0
8  Kumar  Female              81030.0
9   Vats    Male              71900.0

In [18]:
#Calculate and display the average monthly income of the female members in the Shah family.
groups=df1.groupby(["Name", "Gender"])
mean_df=groups.mean()
print("The average monthly income of the female members in the Shah family : ",mean_df.loc['Shah'].loc["Female"].mean())

The average monthly income of the female members in the Shah family :  112400.0